{
  "basics": {
    "name": "Vishal Ramesh",
    "email": "vishal27.rs@outlook.com",
    "phone": null,
    "website": "https://bbloggsbott.github.io",
    "summary": "Results-driven Machine Learning Engineer with 5 years of experience designing, building, and deploying scalable, end-to-end ML solutions in production cloud environments. Specializes in developing production-grade NLP and Decision Support systems, with hands-on experience in microservice architecture (Java, Spring Boot) and robust MLOps pipelines. Proven ability to translate complex enterprise problems into impactful, data-driven applications.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Chennai",
      "countryCode": "IN",
      "region": "Tamil Nadu"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "BBloggsbott",
        "url": "https://github.com/BBloggsbott"
      },
      {
        "network": "LinkedIn",
        "username": "vishal-r-2707",
        "url": "https://www.linkedin.com/in/vishal-r-2707/"
      }
    ]
  },
  "work": [
    {
      "position": "Lead - Data Scientist",
      "startDate": "October 2020",
      "company": "Freshworks",
      "highlights": [
        "Engineered and deployed a Root Cause Analysis (RCA) system, using data analysis to automatically diagnose fluctuations in key support metrics.",
        "Designed and built the core semantic parsing capabilities for the Query-to-Graph chatbot; later extended the system with multilingual support and engineering enhancements to improve scalability and performance.",
        "Built and maintained a scalable, custom intent detection RESTful microservice, creating the infrastructure for users to train, deploy, and manage their own models within the chatbot ecosystem.",
        "Developed and deployed a production-grade model for handling small talk conversations, integrating it into the existing chatbot framework to improve user engagement.",
        "Contributed key research and proof-of-concepts for the design of the ML monitoring pipeline for the company-wide MLOps platform, focusing on best practices for model performance tracking and versioning."
      ]
    }
  ],
  "education": [
    {
      "institution": "SASTRA Deemed to be University",
      "area": "B.Tech in Computer Science and Engineering",
      "studyType": "",
      "startDate": "2016",
      "endDate": "2020",
      "gpa": null,
      "courses": ["Data Structures", "Algorithms", "Database Management Systems", "Artificial Intelligence", "Object-Oriented Design"]
    }
  ],
  "skills": ["FastAPI", "Spring Boot", "Redis", "Docker", "Celery", "TensorFlow",
    "PyTorch", "Scikit-Learn", "NumPy", "Pandas", "AWS", "CI/CD (Jenkins, AWS CodePipeline)", "Databricks", "Git",
    "RDBMS (SQL)", "MongoDB (NoSQL)", "Elasticsearch"
  ],
  "languages": ["Python", "Java"],
  "interests": [],
  "references": [],
  "publications": [],
  "presentations": [],
  "teaching": [],
  "portfolio": []
}
